// Створюємо і експортуємо клас Vector2, який допомагає працювати з координатами X та Y
export class Vector2 {
    // Спеціальна функція (конструктор), яка створює нову точку. 
    // Якщо цифри не передали, ставимо 0 і 0
    constructor(x = 0, y = 0) {
        this.x = x; // Зберігаємо горизонтальну координату
        this.y = y; // Зберігаємо вертикальну координату
    }

    // Додаємо один рух до іншого (наприклад: стара позиція + швидкість)
    add(v) { 
        return new Vector2(this.x + v.x, this.y + v.y); 
    }
    
    // Віднімаємо один вектор від іншого
    sub(v) { 
        return new Vector2(this.x - v.x, this.y - v.y); 
    }
    
    // Множимо координати на число (наприклад, на час dt, щоб рух був плавним)
    scale(n) { 
        return new Vector2(this.x * n, this.y * n); 
    }
    
    // Рахуємо довжину вектора (як гіпотенузу трикутника через теорему Піфагора)
    magnitude() { 
        return Math.hypot(this.x, this.y); 
    }
    
    // Перетворюємо вектор так, щоб його довжина стала рівною 1 (зберігаючи правильний напрямок)
    normalize() {
        const mag = this.magnitude(); // Дізнаємося поточну довжину
        // Якщо довжина 0, повертаємо нулі, інакше ділимо координати на довжину
        return mag === 0 ? new Vector2(0, 0) : new Vector2(this.x / mag, this.y / mag);
    }
    
    // Рахуємо точну відстань між двома точками на екрані
    dist(v) { 
        return this.sub(v).magnitude(); 
    }
}